lofiproject_backend/app/controllers/songs_controller.rb

  def update
    # create association (safe guard)
    @current_user.songs.push(@song) unless @current_user.songs.include?(@song)
---
SELECT 1 AS one FROM "songs" INNER JOIN "songs_users" ON "songs"."id" = "songs_users"."song_id" WHERE "songs_users"."user_id" = $1 AND "songs"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]

  def destroy
    # remove association
    @current_user.songs.delete(@song) unless !@current_user.songs.include?(@song)
---
SELECT 1 AS one FROM "songs" INNER JOIN "songs_users" ON "songs"."id" = "songs_users"."song_id" WHERE "songs_users"."user_id" = $1 AND "songs"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]