lofiproject_backend/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "industry_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "industry_type" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["industry_type", "Software Engineering"], ["updated_at", "2019-10-09 18:46:42.102612"], ["id", 1]]